## Staging: ssm
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 18 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                         NAME                         |
|--------|------------------------------------------------------|
| add    | `aws_ssm_parameter.secrets[&quot;AA_CREDS_POOL&quot;]`         |
|        | `aws_ssm_parameter.secrets[&quot;AIRTABLE_TOKEN&quot;]`        |
|        | `aws_ssm_parameter.secrets[&quot;AW_CLIENT_ID&quot;]`          |
|        | `aws_ssm_parameter.secrets[&quot;AW_CLIENT_SECRET&quot;]`      |
|        | `aws_ssm_parameter.secrets[&quot;AW_COMPANY_ID&quot;]`         |
|        | `aws_ssm_parameter.secrets[&quot;AW_ORGANIZATION_ID&quot;]`    |
|        | `aws_ssm_parameter.secrets[&quot;AW_REPORTSUITE_ID&quot;]`     |
|        | `aws_ssm_parameter.secrets[&quot;AW_TECHNICAL_ID&quot;]`       |
|        | `aws_ssm_parameter.secrets[&quot;DOCDB_PASSWORD&quot;]`        |
|        | `aws_ssm_parameter.secrets[&quot;DOCDB_USERNAME&quot;]`        |
|        | `aws_ssm_parameter.secrets[&quot;FEEDBACK_API_HOST&quot;]`     |
|        | `aws_ssm_parameter.secrets[&quot;FEEDBACK_API_PASSWORD&quot;]` |
|        | `aws_ssm_parameter.secrets[&quot;FEEDBACK_API_USERNAME&quot;]` |
|        | `aws_ssm_parameter.secrets[&quot;GSC_EMAIL&quot;]`             |
|        | `aws_ssm_parameter.secrets[&quot;GSC_KEY&quot;]`               |
|        | `aws_ssm_parameter.secrets[&quot;NOTIFY_API_KEY&quot;]`        |
|        | `aws_ssm_parameter.secrets[&quot;NOTIFY_EMAIL&quot;]`          |
|        | `aws_ssm_parameter.secrets[&quot;NOTIFY_EMAIL_2&quot;]`        |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ssm_parameter.secrets["AA_CREDS_POOL"] will be created
  + resource "aws_ssm_parameter" "secrets" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "AA_CREDS_POOL"
      + tags_all       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.secrets["AIRTABLE_TOKEN"] will be created
  + resource "aws_ssm_parameter" "secrets" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "AIRTABLE_TOKEN"
      + tags_all       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.secrets["AW_CLIENT_ID"] will be created
  + resource "aws_ssm_parameter" "secrets" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "AW_CLIENT_ID"
      + tags_all       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.secrets["AW_CLIENT_SECRET"] will be created
  + resource "aws_ssm_parameter" "secrets" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "AW_CLIENT_SECRET"
      + tags_all       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.secrets["AW_COMPANY_ID"] will be created
  + resource "aws_ssm_parameter" "secrets" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "AW_COMPANY_ID"
      + tags_all       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.secrets["AW_ORGANIZATION_ID"] will be created
  + resource "aws_ssm_parameter" "secrets" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "AW_ORGANIZATION_ID"
      + tags_all       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.secrets["AW_REPORTSUITE_ID"] will be created
  + resource "aws_ssm_parameter" "secrets" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "AW_REPORTSUITE_ID"
      + tags_all       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.secrets["AW_TECHNICAL_ID"] will be created
  + resource "aws_ssm_parameter" "secrets" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "AW_TECHNICAL_ID"
      + tags_all       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.secrets["DOCDB_PASSWORD"] will be created
  + resource "aws_ssm_parameter" "secrets" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "DOCDB_PASSWORD"
      + tags_all       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.secrets["DOCDB_USERNAME"] will be created
  + resource "aws_ssm_parameter" "secrets" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "DOCDB_USERNAME"
      + tags_all       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.secrets["FEEDBACK_API_HOST"] will be created
  + resource "aws_ssm_parameter" "secrets" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "FEEDBACK_API_HOST"
      + tags_all       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.secrets["FEEDBACK_API_PASSWORD"] will be created
  + resource "aws_ssm_parameter" "secrets" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "FEEDBACK_API_PASSWORD"
      + tags_all       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.secrets["FEEDBACK_API_USERNAME"] will be created
  + resource "aws_ssm_parameter" "secrets" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "FEEDBACK_API_USERNAME"
      + tags_all       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.secrets["GSC_EMAIL"] will be created
  + resource "aws_ssm_parameter" "secrets" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "GSC_EMAIL"
      + tags_all       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.secrets["GSC_KEY"] will be created
  + resource "aws_ssm_parameter" "secrets" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "GSC_KEY"
      + tags_all       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.secrets["NOTIFY_API_KEY"] will be created
  + resource "aws_ssm_parameter" "secrets" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "NOTIFY_API_KEY"
      + tags_all       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.secrets["NOTIFY_EMAIL"] will be created
  + resource "aws_ssm_parameter" "secrets" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "NOTIFY_EMAIL"
      + tags_all       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.secrets["NOTIFY_EMAIL_2"] will be created
  + resource "aws_ssm_parameter" "secrets" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "NOTIFY_EMAIL_2"
      + tags_all       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ssm_secret_arns = [
      + {
          + name      = "AA_CREDS_POOL"
          + valueFrom = (known after apply)
        },
      + {
          + name      = "AIRTABLE_TOKEN"
          + valueFrom = (known after apply)
        },
      + {
          + name      = "AW_CLIENT_ID"
          + valueFrom = (known after apply)
        },
      + {
          + name      = "AW_CLIENT_SECRET"
          + valueFrom = (known after apply)
        },
      + {
          + name      = "AW_COMPANY_ID"
          + valueFrom = (known after apply)
        },
      + {
          + name      = "AW_ORGANIZATION_ID"
          + valueFrom = (known after apply)
        },
      + {
          + name      = "AW_REPORTSUITE_ID"
          + valueFrom = (known after apply)
        },
      + {
          + name      = "AW_TECHNICAL_ID"
          + valueFrom = (known after apply)
        },
      + {
          + name      = "DOCDB_PASSWORD"
          + valueFrom = (known after apply)
        },
      + {
          + name      = "DOCDB_USERNAME"
          + valueFrom = (known after apply)
        },
      + {
          + name      = "FEEDBACK_API_HOST"
          + valueFrom = (known after apply)
        },
      + {
          + name      = "FEEDBACK_API_PASSWORD"
          + valueFrom = (known after apply)
        },
      + {
          + name      = "FEEDBACK_API_USERNAME"
          + valueFrom = (known after apply)
        },
      + {
          + name      = "GSC_EMAIL"
          + valueFrom = (known after apply)
        },
      + {
          + name      = "GSC_KEY"
          + valueFrom = (known after apply)
        },
      + {
          + name      = "NOTIFY_API_KEY"
          + valueFrom = (known after apply)
        },
      + {
          + name      = "NOTIFY_EMAIL"
          + valueFrom = (known after apply)
        },
      + {
          + name      = "NOTIFY_EMAIL_2"
          + valueFrom = (known after apply)
        },
    ]

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.secrets[\"AA_CREDS_POOL\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.secrets[\"AIRTABLE_TOKEN\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.secrets[\"AW_CLIENT_ID\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.secrets[\"AW_CLIENT_SECRET\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.secrets[\"AW_COMPANY_ID\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.secrets[\"AW_ORGANIZATION_ID\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.secrets[\"AW_REPORTSUITE_ID\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.secrets[\"AW_TECHNICAL_ID\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.secrets[\"DOCDB_PASSWORD\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.secrets[\"DOCDB_USERNAME\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.secrets[\"FEEDBACK_API_HOST\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.secrets[\"FEEDBACK_API_PASSWORD\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.secrets[\"FEEDBACK_API_USERNAME\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.secrets[\"GSC_EMAIL\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.secrets[\"GSC_KEY\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.secrets[\"NOTIFY_API_KEY\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.secrets[\"NOTIFY_EMAIL\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.secrets[\"NOTIFY_EMAIL_2\"]"]

37 tests, 19 passed, 18 warnings, 0 failures, 0 exceptions

```

</details>
